<span style="font-size: 20px;"><strong>Desafios Pandas</span></strong>

<span style="font-size: 20px;"><strong>1. Desafio informações</span></strong>

In [1]:
import pandas as pd
import json

In [4]:
dados = pd.read_json("informacoes.json")
dados.head()

   nome  idade                                          enderecos
0  João     28  {'tipo': 'casa', 'rua': 'Rua A', 'numero': 123...
1  João     28  {'tipo': 'trabalho', 'rua': 'Rua B', 'numero':...

In [5]:
with open('informacoes.json') as f:
    dados = json.load(f)

informacoes = pd.json_normalize(dados, record_path='enderecos', meta=['nome', 'idade'])
informacoes

       tipo    rua  numero          cidade   nome idade
0      casa  Rua A     123      SÃ£o Paulo  JoÃ£o    28
1  trabalho  Rua B     456  Rio de Janeiro  JoÃ£o    28

<span style="font-size: 20px;"><strong>2. Desafio dados</span></strong>

In [9]:
with open('dados.json', 'r') as f:
    dados = json.load(f)

dados

{'pessoas': [{'nome': 'JoÃ£o',
   'idade': '25',
   'endereco': {'rua': 'Rua A', 'numero': 123, 'cidade': 'SÃ£o Paulo'},
   'telefones': ['11 1111-1111', '11 2222-2222']},
  {'nome': 'Maria',
   'idade': 30,
   'endereco': {'rua': '', 'numero': 456, 'cidade': 'Rio de Janeiro'},
   'telefones': ['21 3333-3333']}]}

In [10]:
df = pd.json_normalize(dados, record_path=['pessoas'])
df

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,JoÃ£o,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,SÃ£o Paulo
1,Maria,30,[21 3333-3333],,456,Rio de Janeiro

In [11]:
# identificando os tipos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             2 non-null      object
 1   idade            2 non-null      object
 2   telefones        2 non-null      object
 3   endereco.rua     2 non-null      object
 4   endereco.numero  2 non-null      int64
 5   endereco.cidade  2 non-null      object
dtypes: int64(1), object(5)
memory usage: 228.0+ bytes

In [14]:
df['idade'] = df['idade'].astype(int)
df.info() # conferindo

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             2 non-null      object
 1   idade            2 non-null      int32
 2   telefones        2 non-null      object
 3   endereco.rua     2 non-null      object
 4   endereco.numero  2 non-null      int64
 5   endereco.cidade  2 non-null      object
dtypes: int32(1), int64(1), object(4)
memory usage: 220.0+ bytes

In [15]:
df_filtrado = df.query('`endereco.rua` != ""')

In [17]:
df_filtrado

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,JoÃ£o,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,SÃ£o Paulo

In [23]:
coluna = list(df_filtrado.columns)
df_filtrado = df_filtrado.explode(coluna[2])
df_filtrado

    nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0  JoÃ£o     25  11 1111-1111        Rua A              123      SÃ£o Paulo
0  JoÃ£o     25  11 2222-2222        Rua A              123      SÃ£o Paulo

In [41]:
df_filtrado['endereco.cidade'] = df_filtrado['endereco.cidade'].str.replace('£', '').replace('Ã', 'ã')
df_filtrado

   nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0  joão     25  11 1111-1111        Rua A              123       SÃo Paulo
0  joão     25  11 2222-2222        Rua A              123       SÃo Paulo

In [32]:
df_filtrado['nome'] = df_filtrado['nome'].str.replace('£', '')
df_filtrado

   nome  idade     telefones endereco.rua  endereco.numero endereco.cidade
0  JoÃo     25  11 1111-1111        Rua A              123       SÃo Paulo
0  JoÃo     25  11 2222-2222        Rua A              123       SÃo Paulo

<span style="font-size: 20px;"><strong>3. Desafio cursos cadastrados </span></strong>

In [72]:
with open('cursos_cadastrados.json', 'r') as f:
    data = json.load(f)

data

[{'curso': 'IntroduÃ§Ã£o Ã\xa0 programaÃ§Ã£o',
  'categoria': 'ProgramaÃ§Ã£o',
  'carga_horaria': '20 horas',
  'concluintes': 100,
  'data_inicio': '2022-01-01',
  'data_conclusao': '2022-01-20',
  'descricao': 'Curso introdutÃ³rio Ã\xa0 programaÃ§Ã£o com Python',
  'preco': '99.90',
  'instrutor': {'nome': 'JoÃ£o Silva',
   'email': 'joao.silva@emailaleatorio.com',
   'telefone': '(11) 9999-9999'}},
 {'curso': 'Excel para iniciantes',
  'categoria': 'Produtividade',
  'carga_horaria': None,
  'concluintes': None,
  'data_inicio': None,
  'data_conclusao': None,
  'descricao': None,
  'preco': None,
  'instrutor': {'nome': 'Maria Oliveira',
   'email': 'maria.oliveira@emailaleatorio.com',
   'telefone': '(11) 8888-8888'}},
 {'curso': 'Marketing digital para negÃ³cios',
  'categoria': 'Marketing',
  'carga_horaria': '30 horas',
  'concluintes': 75,
  'data_inicio': '2022-03-01',
  'data_conclusao': '2022-03-31',
  'descricao': 'Curso introdutÃ³rio em marketing',
  'preco': 89.9,
  'instrutor': {'nome': 'Ana Santos',
   'email': 'ana.santos@emailaleatorio.com',
   'telefone': '(11) 7777-7777'}},
 {'curso': 'InteligÃªncia artificial',
  'categoria': 'ProgramaÃ§Ã£o',
  'carga_horaria': '40 horas',
  'concluintes': '',
  'data_inicio': '2022-04-01',
  'data_conclusao': '',
  'descricao': 'Curso avanÃ§ado sobre inteligÃªncia artificial com Python',
  'preco': 129.9,
  'instrutor': {'nome': '',
   'email': 'contato@emailaleatorio.com',
   'telefone': ''}},
 {'curso': 'InglÃªs para negÃ³cios',
  'categoria': 'Idiomas',
  'carga_horaria': '20 horas',
  'concluintes': 30,
  'data_inicio': '',
  'data_conclusao': '',
  'descricao': 'Curso de inglÃªs para negÃ³cios',
  'preco': 69.9,
  'instrutor': {'nome': 'John Smith', 'email': '', 'telefone': ''}},
 {'curso': 'IntroduÃ§Ã£o Ã\xa0 programaÃ§Ã£o',
  'categoria': 'ProgramaÃ§Ã£o',
  'carga_horaria': '20 horas',
  'concluintes': 100,
  'data_inicio': '2022-01-01',
  'data_conclusao': '2022-01-20',
  'descricao': 'Curso introdutÃ³rio Ã\xa0 programaÃ§Ã£o com Python',
  'preco': '99.90',
  'instrutor': {'nome': 'JoÃ£o Silva',
   'email': 'joao.silva@emailaleatorio.com',
   'telefone': '(11) 9999-9999'}}]

In [73]:
# normalizando o json
dt = pd.json_normalize(data)
dt

,curso,categoria,carga_horaria,concluintes,data_inicio,data_conclusao,descricao,preco,instrutor.nome,instrutor.email,instrutor.telefone
0,IntroduÃ§Ã£o Ã programaÃ§Ã£o,ProgramaÃ§Ã£o,20 horas,100,2022-01-01,2022-01-20,Curso introdutÃ³rio Ã programaÃ§Ã£o com Python,99.90,JoÃ£o Silva,joao.silva@emailaleatorio.com,(11) 9999-9999
1,Excel para iniciantes,Produtividade,None,None,None,None,None,None,Maria Oliveira,maria.oliveira@emailaleatorio.com,(11) 8888-8888
2,Marketing digital para negÃ³cios,Marketing,30 horas,75,2022-03-01,2022-03-31,Curso introdutÃ³rio em marketing,89.9,Ana Santos,ana.santos@emailaleatorio.com,(11) 7777-7777
3,InteligÃªncia artificial,ProgramaÃ§Ã£o,40 horas,,2022-04-01,,Curso avanÃ§ado sobre inteligÃªncia artificial...,129.9,,contato@emailaleatorio.com,
4,InglÃªs para negÃ³cios,Idiomas,20 horas,30,,,Curso de inglÃªs para negÃ³cios,69.9,John Smith,,
5,IntroduÃ§Ã£o Ã programaÃ§Ã£o,ProgramaÃ§Ã£o,20 horas,100,2022-01-01,2022-01-20,Curso introdutÃ³rio Ã programaÃ§Ã£o com Python,99.90,JoÃ£o Silva,joao.silva@emailaleatorio.com,(11) 9999-9999

In [75]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   curso               6 non-null      object
 1   categoria           6 non-null      object
 2   carga_horaria       5 non-null      object
 3   concluintes         5 non-null      object
 4   data_inicio         5 non-null      object
 5   data_conclusao      5 non-null      object
 6   descricao           5 non-null      object
 7   preco               5 non-null      object
 8   instrutor.nome      6 non-null      object
 9   instrutor.email     6 non-null      object
 10  instrutor.telefone  6 non-null      object
dtypes: object(11)
memory usage: 660.0+ bytes

In [76]:
# primeiro transformando as colunas curso e descricao de objeto para string
dt['curso'] = dt['curso'].astype(str)
dt['descricao'] = dt['descricao'].astype(str)

# Função para substituir caracteres especiais e converter "Ã" para minúscula
def limpar_texto(texto):
    texto = texto.replace('§', '').replace('£', '').replace('³', '').replace('ª', '').replace('Ã', 'ã')
    return texto.lower()

# Aplicando a função às colunas 'curso' e 'descricao'
dt[['curso', 'descricao']] = dt[['curso', 'descricao']].applymap(limpar_texto)
dt

C:\Users\milla\AppData\Local\Temp\ipykernel_13536\1528849880.py:11: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  dt[['curso', 'descricao']] = dt[['curso', 'descricao']].applymap(limpar_texto)

,curso,categoria,carga_horaria,concluintes,data_inicio,data_conclusao,descricao,preco,instrutor.nome,instrutor.email,instrutor.telefone
0,introduãão ã programaãão,ProgramaÃ§Ã£o,20 horas,100,2022-01-01,2022-01-20,curso introdutãrio ã programaãão com python,99.90,JoÃ£o Silva,joao.silva@emailaleatorio.com,(11) 9999-9999
1,excel para iniciantes,Produtividade,None,None,None,None,none,None,Maria Oliveira,maria.oliveira@emailaleatorio.com,(11) 8888-8888
2,marketing digital para negãcios,Marketing,30 horas,75,2022-03-01,2022-03-31,curso introdutãrio em marketing,89.9,Ana Santos,ana.santos@emailaleatorio.com,(11) 7777-7777
3,inteligãncia artificial,ProgramaÃ§Ã£o,40 horas,,2022-04-01,,curso avanãado sobre inteligãncia artificial c...,129.9,,contato@emailaleatorio.com,
4,inglãs para negãcios,Idiomas,20 horas,30,,,curso de inglãs para negãcios,69.9,John Smith,,
5,introduãão ã programaãão,ProgramaÃ§Ã£o,20 horas,100,2022-01-01,2022-01-20,curso introdutãrio ã programaãão com python,99.90,JoÃ£o Silva,joao.silva@emailaleatorio.com,(11) 9999-9999

In [77]:
# Identificando e removendo amostras com valores nulos
dt.isnull().sum().sum() #verificando se há dados nulos

5

In [78]:
dt[dt.isna().any(axis=1)]   # Descobrindo quais são as amostras

,curso,categoria,carga_horaria,concluintes,data_inicio,data_conclusao,descricao,preco,instrutor.nome,instrutor.email,instrutor.telefone
1,excel para iniciantes,Produtividade,None,None,None,None,none,None,Maria Oliveira,maria.oliveira@emailaleatorio.com,(11) 8888-8888

In [79]:
dt.dropna(inplace=True)  # Removendo esses dados

In [80]:
# Identificando e removendo amostras com valores duplicados
dt.duplicated() # verificando se há dados duplicados

0    False
2    False
3    False
4    False
5     True
dtype: bool

In [81]:
dt.drop_duplicates(inplace=True) # removendo o que está duplicado no índice 5

In [82]:
# Remover as amostras com strings vazias
dt[dt['instrutor.nome'] == ""] # verificando se há strings vazias

,curso,categoria,carga_horaria,concluintes,data_inicio,data_conclusao,descricao,preco,instrutor.nome,instrutor.email,instrutor.telefone
3,inteligãncia artificial,ProgramaÃ§Ã£o,40 horas,,2022-04-01,,curso avanãado sobre inteligãncia artificial c...,129.9,,contato@emailaleatorio.com,

In [83]:
dt.replace('', pd.NA, inplace=True)   # Substituindo strings vazias por valores nulos

In [84]:
dt.dropna(inplace=True) # removendo as amostras contendo NA

In [85]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 2
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   curso               2 non-null      object
 1   categoria           2 non-null      object
 2   carga_horaria       2 non-null      object
 3   concluintes         2 non-null      object
 4   data_inicio         2 non-null      object
 5   data_conclusao      2 non-null      object
 6   descricao           2 non-null      object
 7   preco               2 non-null      object
 8   instrutor.nome      2 non-null      object
 9   instrutor.email     2 non-null      object
 10  instrutor.telefone  2 non-null      object
dtypes: object(11)
memory usage: 192.0+ bytes

In [86]:
# Converte a concluintes para o tipo inteiro
dt['concluintes'] = dt['concluintes'].astype(int)

# Converte a coluna data_inicio e data_conclusao para o tipo datetime
dt['data_inicio'] = pd.to_datetime(dt['data_inicio'])
dt['data_conclusao'] = pd.to_datetime(dt['data_conclusao'])

# Convertendo a coluna preço para o tipo float
dt['preco'] = dt['preco'].astype(float)

In [88]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 0 to 2
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   curso               2 non-null      object
 1   categoria           2 non-null      object
 2   carga_horaria       2 non-null      object
 3   concluintes         2 non-null      int32
 4   data_inicio         2 non-null      datetime64[ns]
 5   data_conclusao      2 non-null      datetime64[ns]
 6   descricao           2 non-null      object
 7   preco               2 non-null      float64
 8   instrutor.nome      2 non-null      object
 9   instrutor.email     2 non-null      object
 10  instrutor.telefone  2 non-null      object
dtypes: datetime64[ns](2), float64(1), int32(1), object(7)
memory usage: 184.0+ bytes

<span style="font-size: 20px;"><strong>3. Desafio identificando fraudes </span></strong>

In [2]:
# criando um DataFrame com 30 transações aleatórias
df = pd.DataFrame({
    'ID da transação': range(1, 31),
    'Valor da transação': [100, 200, 150, 500, 300, 913, 250, 400, 200, 150, 
                           200, 200, 400, 300, 150, 301, 805, 300, 400, 250, 
                           150, 100, 500, 600, 200, 350, 100, 250, 800, 250],
    'Data da transação': pd.date_range(start='2022-01-01', end='2022-01-30', freq='D'),
    'Local da transação': ['São Paulo, Brasil', 'Rio de Janeiro, Brasil', 'Belo Horizonte, Brasil', 'São Paulo, Brasil', 
                           'São Paulo, Brasil', 'Nova Iorque, EUA', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil',
                           'Rio de Janeiro, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil',
                           'São Paulo, Brasil', 'São Paulo, Brasil', 'Los Angeles, EUA', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil',
                           'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil', 'São Paulo, Brasil',
                           'São Paulo, Brasil', 'São Paulo, Brasil', 'Miami, EUA', 'São Paulo, Brasil']
})

In [3]:
def calc_outliers(column, dataframe): 

  # calculando o IQR e definindo o limite para outliers
  Q1 = dataframe[column].quantile(0.25)
  Q3 = dataframe[column].quantile(0.75)
  IQR = Q3 - Q1
  limite_inferior = Q1 - 1.5 * IQR
  limite_superior = Q3 + 1.5 * IQR

  # identificando os outliers
  outliers = dataframe[(dataframe[column] < limite_inferior) | (dataframe[column] > limite_superior)]

  # retornando os outliers
  return outliers

In [4]:
print(calc_outliers('Valor da transação', df))

    ID da transação  Valor da transação Data da transação Local da transação
5                 6                 913        2022-01-06   Nova Iorque, EUA
16               17                 805        2022-01-17   Los Angeles, EUA
28               29                 800        2022-01-29         Miami, EUA